;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
;; (package! doom-modeline)
(package! exec-path-from-shell)
(package! focus-autosave-mode)
(package! terminal-focus-reporting)
(package! evil-surround)
(package! evil-escape)
(package! evil-quickscope)
(package! evil-easymotion)
(package! es-mode)
(package! json-mode)
